#### 코로나 바이러스 영향으로 중국인 관광객 증감분석

#### 외국인 출입국 통계 데이터

####  한국관광 데이터랩 : https://datalab.visitkorea.or.kr/
- 제공하는 데이터랩 : https://datalab.visitkorea.or.kr/
제공하는 csv파일을 추가작업으로 년월별 xlsx로 변경

##### 엑셀데이터 로드
기준 2019년 1월 데이터

In [1]:
# 데이터분석용 모듈 임포트
import pandas as pd
import numpy as np

In [5]:
# 2019년 1월 엑셀데이터 로드
# 전년동기~구성비 까지 컬럼은 필요없음
# 행 전년동기~구성비까지 내용은 스킵
kto_201901 = pd.read_excel('./raw/kto_201901.xlsx'
                            ,header=1
                            ,usecols='A:G'
                            ,skipfooter=4)
kto_201901.head()

     국적      관광     상용    공용  유학/연수      기타       계
0  아시아주  765082  10837  1423  14087  125521  916950
1    일본  198805   2233   127    785    4576  206526
2    대만   86393     74    22    180    1285   87954
3    홍콩   34653     59     2     90    1092   35896
4   마카오    2506      2     0     17      45    2570

In [8]:
kto_201901.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적      67 non-null     object
 1   관광      67 non-null     int64
 2   상용      67 non-null     int64
 3   공용      67 non-null     int64
 4   유학/연수   67 non-null     int64
 5   기타      67 non-null     int64
 6   계       67 non-null     int64
dtypes: int64(6), object(1)
memory usage: 3.8+ KB

In [6]:
#행과 열값
kto_201901.tail()

         국적   관광   상용  공용  유학/연수     기타      계
62  아프리카 기타  768  718  90    206    908   2690
63     기타대륙   33    4   0      1     16     54
64     국적미상   33    4   0      1     16     54
65     교포소계    0    0   0      0  15526  15526
66       교포    0    0   0      0  15526  15526

In [7]:
#
kto_201901.shape

(67, 7)

In [9]:
#수치통계
kto_201901.describe()

,관광,상용,공용,유학/연수,기타,계
count,67.00000,67.000000,67.000000,67.000000,67.000000,67.000000
mean,26396.80597,408.208955,132.507463,477.462687,5564.208955,32979.194030
std,102954.04969,1416.040302,474.406339,2009.484800,17209.438418,122821.369969
min,0.00000,0.000000,0.000000,0.000000,16.000000,54.000000
25%,505.00000,14.500000,2.500000,17.500000,260.000000,927.000000
50%,1304.00000,45.000000,14.000000,43.000000,912.000000,2695.000000
75%,8365.00000,176.500000,38.000000,182.000000,2824.500000,14905.500000
max,765082.00000,10837.000000,2657.000000,14087.000000,125521.000000,916950.000000

In [14]:
# 각 컬럼 0 부분이 필터링
condition = (kto_201901['관광'] == 0 ) |\
            (kto_201901['상용'] == 0 ) |\
            (kto_201901['공용'] == 0 ) |\
            (kto_201901['유학/연수'] == 0 ) |\
            (kto_201901['공용'] == 0 ) |\
            (kto_201901['기타'] == 0 ) 
kto_201901_zero = kto_201901[condition]
kto_201901_zero

        국적    관광   상용  공용  유학/연수     기타      계
4      마카오  2506    2   0     17     45   2570
20    이스라엘   727   12   0      9     57    805
22  우즈베키스탄  1958  561   0    407   2828   5754
38     스위스   613   18   0     19     97    747
45     그리스   481   17   4      0    273    775
46    포르투갈   416   14   0     13    121    564
51   크로아티아   226   12   0      3    250    491
54     폴란드   713   10   0     27    574   1324
59  대양주 기타   555    3   4      0     52    614
63    기타대륙    33    4   0      1     16     54
64    국적미상    33    4   0      1     16     54
65    교포소계     0    0   0      0  15526  15526
66      교포     0    0   0      0  15526  15526

In [15]:
# df에 기준년월 추가
kto_201901['기준년월'] = '2019-01'
kto_201901.tail()

         국적   관광   상용  공용  유학/연수     기타      계     기준년월
62  아프리카 기타  768  718  90    206    908   2690  2019-01
63     기타대륙   33    4   0      1     16     54  2019-01
64     국적미상   33    4   0      1     16     54  2019-01
65     교포소계    0    0   0      0  15526  15526  2019-01
66       교포    0    0   0      0  15526  15526  2019-01

In [20]:
# 국적데이터만 67개 중
#unique() 는 numpy.ndarray변환
# 원래 67개, unique() 67개 (의미없음)
kto_201901['국적'].unique()

array(['아시아주', '일본', '대만', '홍콩', '마카오', '태국', '말레이시아', '필리핀', '인도네시아',
       '싱가포르', '미얀마', '베트남', '인도', '스리랑카', '파키스탄', '방글라데시', '캄보디아', '몽골',
       '중국', '이란', '이스라엘', '터키', '우즈베키스탄', '카자흐스탄', 'GCC', '아시아 기타', '미주',
       '미국', '캐나다', '멕시코', '브라질', '미주 기타', '구주', '영국', '독일', '프랑스',
       '네덜란드', '스웨덴', '스위스', '이탈리아', '덴마크', '노르웨이', '벨기에', '오스트리아', '스페인',
       '그리스', '포르투갈', '핀란드', '아일랜드', '우크라이나', '러시아', '크로아티아', '루마니아',
       '불가리아', '폴란드', '구주 기타', '대양주', '오스트레일리아', '뉴질랜드', '대양주 기타',
       '아프리카주', '남아프리카공화국', '아프리카 기타', '기타대륙', '국적미상', '교포소계', '교포'],
      dtype=object)

In [29]:
kto_201901.국적.unique()

array(['아시아주', '일본', '대만', '홍콩', '마카오', '태국', '말레이시아', '필리핀', '인도네시아',
       '싱가포르', '미얀마', '베트남', '인도', '스리랑카', '파키스탄', '방글라데시', '캄보디아', '몽골',
       '중국', '이란', '이스라엘', '터키', '우즈베키스탄', '카자흐스탄', 'GCC', '아시아 기타', '미주',
       '미국', '캐나다', '멕시코', '브라질', '미주 기타', '구주', '영국', '독일', '프랑스',
       '네덜란드', '스웨덴', '스위스', '이탈리아', '덴마크', '노르웨이', '벨기에', '오스트리아', '스페인',
       '그리스', '포르투갈', '핀란드', '아일랜드', '우크라이나', '러시아', '크로아티아', '루마니아',
       '불가리아', '폴란드', '구주 기타', '대양주', '오스트레일리아', '뉴질랜드', '대양주 기타',
       '아프리카주', '남아프리카공화국', '아프리카 기타', '기타대륙', '국적미상', '교포소계', '교포'],
      dtype=object)

In [22]:
# 대륙목록
contients_list = ['아시아주','미주','구주','대양주','아프리카주','기타대륙','교포개국']
#'미주'.strip()[-1] == '주'
contients_list

['아시아주', '미주', '구주', '대양주', '아프리카주', '기타대륙', '교포개국']

In [31]:
# kto_201901[(kto_201901['국적'].isin(contients_list) == False)]
kto_201901_country = kto_201901[(kto_201901['국적'].isin(contients_list) == False)]
# kto_201901_country.국적.unique()
kto_201901_country

          국적      관광    상용   공용  유학/연수     기타       계     기준년월
1         일본  198805  2233  127    785   4576  206526  2019-01
2         대만   86393    74   22    180   1285   87954  2019-01
3         홍콩   34653    59    2     90   1092   35896  2019-01
4        마카오    2506     2    0     17     45    2570  2019-01
5         태국   34004    37  199     96   6998   41334  2019-01
..       ...     ...   ...  ...    ...    ...     ...      ...
61  남아프리카공화국     368     9    1      6    616    1000  2019-01
62   아프리카 기타     768   718   90    206    908    2690  2019-01
64      국적미상      33     4    0      1     16      54  2019-01
65      교포소계       0     0    0      0  15526   15526  2019-01
66        교포       0     0    0      0  15526   15526  2019-01

[61 rows x 8 columns]